dataFoam/example_data/case_1p0_DNS/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14751
(
(1.578431838995748675e-03 -1.385986582818017596e-07 2.325296237108205711e-06)
(1.580319311497504391e-03 -8.801269620890203286e-08 2.368423242686166021e-06)
(1.579785248456056510e-03 1.193193484011622978e-07 2.381287884283474463e-06)
(1.576726127451689042e-03 8.784122787321396980e-08 2.378940355929148301e-06)
(1.571127218787619602e-03 3.031190592849361709e-07 2.387707448653424871e-06)
(1.563182053841262378e-03 3.429888281449730371e-07 2.407295805711626835e-06)
(1.552988025484871096e-03 4.204740709589941323e-07 2.438297143924539349e-06)
(1.540614617202319030e-03 6.059242447460635015e-07 2.425415529446574831e-06)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}
