dataFoam/example_data/case_1p0_DNS/0/Tau_rans
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      Tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
14751
(
(3.74632e-09 2.71364e-11 4.73702e-36 3.74629e-09 3.75577e-36 3.74631e-09)
(3.90621e-09 2.86903e-11 4.07666e-37 3.90617e-09 1.0192e-43 3.90619e-09)
(4.08596e-09 3.05306e-11 2.18032e-35 4.08594e-09 2.11573e-32 4.08595e-09)
(4.26969e-09 3.23137e-11 -2.21154e-35 4.26967e-09 9.19303e-34 4.26968e-09)
(4.46371e-09 3.42297e-11 1.47648e-35 4.4637e-09 -1.03355e-31 4.4637e-09)
(4.6655e-09 3.61401e-11 -1.69881e-33 4.6655e-09 -2.51099e-33 4.66549e-09)
(4.87196e-09 3.80558e-11 4.06429e-35 4.87197e-09 -1.35508e-33 4.87196e-09)
(5.08685e-09 4.00019e-11 1.47364e-35 5.08687e-09 2.34381e-35 5.08685e-09)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (6.66667e-16 -0 0 6.66667e-16 -0 6.66667e-16);
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (6.66667e-16 0 0 6.66667e-16 -0 6.66667e-16);
    }
}


// ************************************************************************* //
